In [1]:
Assignment---
Introduction 
This assignment will help you to consolidate the concepts learnt in the session. 
2.Problem Statement 
It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis? Take this monstrosity as the DataFrame to use in the following puzzles: 
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']}) 
1. Some values in the the FlightNumber column are missing.
These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place.
Fill in these missing numbers and make the column an integer column (instead of a float column). 
2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give 
a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame. 
3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. 
Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".) 
4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions. 
5. In the RecentDelays column, the values have been entered into the DataFrame as a list.
We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. 
Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays. 
Note: Solution submitted via github must contain all the source code and output. 
3. Expected Output 
This assignment consists of 200 marks and has to be submitted in .ipynb format in the upcoming session for evaluation.

SyntaxError: invalid syntax (<ipython-input-1-826d369ab240>, line 1)

In [1]:
#importing library pandas and numpy 
import pandas as pd
import numpy as np
import warnings

In [2]:
#assigning data as dataframe with pandas
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [5]:
##1.Filling the flight number missing value -- doing manually as their are only 2 values missing otherwise use loop
#   and typecasting FlightNumber into int
df['FlightNumber'][1]=df['FlightNumber'][0]+10
df['FlightNumber'][3]=df['FlightNumber'][2]+10
df['FlightNumber']=df['FlightNumber'].astype(int)
df.dtypes

<ipython-input-5-922cd11e86db>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][1]=df['FlightNumber'][0]+10
<ipython-input-5-922cd11e86db>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][3]=df['FlightNumber'][2]+10

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [6]:
#2 Created temp dataframe which contains columns From and To seperately
temp=pd.DataFrame()
temp[['From','To']]=df.From_To.str.split("_",expand=True)
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [7]:
#3 Capitalizing From and To column in proper way
temp['From']=temp['From'].str.capitalize()
temp['To']=temp['To'].str.capitalize()

In [8]:
#4.Dropping column From_to and concating temp dataframe and orignal dataframe creating new_df dataframe
df.drop(labels=['From_To'],axis=1,inplace=True)
new_df=pd.concat([df,temp],axis=1)
new_df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [9]:
#5.finding no of delay_n we need to take into consideration by taking the max 
x=0
for i in range(0,len(new_df['RecentDelays'])):
    lng = len(new_df['RecentDelays'][i])
    if(lng > x ):
        x=lng
    else:
        continue
print("Maximum no of delays in Recent Delays is",x)

Maximum no of delays in Recent Delays is 3

In [10]:
#declaring empty list to store delay_1 till delay_n.
tlist1=[]
tlist2=[]
tlist3=[]

In [11]:
#loop for traversing row-wise and column-wise 3*5 shape
for i in range(0,len(new_df)):
    for j in range(0,x):
        if(j == 0):
            try:
                tlist1.append(new_df['RecentDelays'][i][j])
            except Exception as e:
                tlist1.append(np.NaN)
        if(j == 1):
            try:
                tlist2.append(new_df['RecentDelays'][i][j])
            except Exception as e:
                tlist2.append(np.NaN)
        if(j == 2):
            try:
                tlist3.append(new_df['RecentDelays'][i][j])
            except Exception as e:
                tlist3.append(np.NaN)
                #new_df['delay_1'][i][j] = 0 #np.NaN

In [12]:
#Zipping final list and assigning to datframe name 'delay'
final_list=list(zip(tlist1, tlist2, tlist3))
delay=pd.DataFrame(final_list,columns=['delay_1','delay_2','delay_3'])

In [13]:
#new_df=pd.concat([new_df,delay],axis=1)
new_df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [14]:
new_df=pd.concat([new_df,delay],axis=1)

In [15]:
new_df.drop(labels=['RecentDelays'],axis=1,inplace=True)

In [16]:
new_df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [17]:
new_df.dtypes

FlightNumber      int32
Airline          object
From             object
To               object
delay_1         float64
delay_2         float64
delay_3         float64
dtype: object